artillery/load-test-auth.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
  processor: "./loginProcessor.js"
  plugins:
    cookie: {}

scenarios:
  - name: Login e acesso autenticado
    flow:
      - post:
          url: "/user/login"
          headers:
            content-type: "application/x-www-form-urlencoded"
          form:
            email: "{{ email }}"
            password: "{{ password }}"
      - get:
          url: "/event"
      - get:
          url: "/bingoCard?idEvent=1"